app/controllers/products_controller.rb

SELECT `products`.* FROM `products`
---
  def index
    products = Product.all

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
  def show
    render json: Product.find(params[:id])

INSERT INTO `products` (`name`, `model`, `manufacturer`, `created_at`, `updated_at`) VALUES ('alicate', 'belzer', 'bz1', '2019-10-29 14:00:05', '2019-10-29 14:00:05')
---
  def create
    Product.create(product_params)