app/controllers/ratings_controller.rb

  def show
    @product = Product.find(params['id'])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1

  def create
    product = Product.find(params['product_id'])

    if product
      Rating.features.each{ |f| Rating.create(feature: f[1], grade: params[f[0]], product: product) }
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 6 LIMIT 1
INSERT INTO `ratings` (`grade`, `feature`, `product_id`, `created_at`, `updated_at`) VALUES (-500, 1, 1, '2019-10-29 07:06:52', '2019-10-29 07:06:52')
SELECT  `ratings`.* FROM `ratings` ORDER BY `ratings`.`id` DESC LIMIT 1